docs/inclass04A.org
#+TITLE: SWE 619 In Class Exercise Number 4A

#+HTML_HEAD: <link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org.css">
#+HTML_HEAD: <link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org-orig.css">

* Instructions
  
  Consider the Java =Iterator<E>= interface:

  #+begin_src java
    public boolean hasNext();
    public E next() throws NoSuchElementException
    public void remove() throws IllegalStateException
  #+end_src

  1. What is the abstract state of an iterator without the =remove()= method?
  1. Work through an example iterating over a list of strings: =["bat", "cat", "dog"]=
  1. What is the abstract state of an iterator with a =previous()= method?
  1. What is the abstract state of an iterator with the =remove()= method?
  1. Design an immutable version of the iterator.
    1. How is =hasNext()= handled?
    1. How is =next()= handled?
    1. How is =remove()= handled?
  1. Exercise the immutable iterator with some sample client code. 

* Links
  - [[./index.html][Syllabus]]
  - [[./schedule.html][Schedule]]

