docs/inclass04A.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-10 Sat 19:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SWE 619 In Class Exercise Number 4A</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ThanhVu (Vu) Nguyen" />
<link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org.css">
<link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org-orig.css">
</head>
<body>
<div id="content">
<h1 class="title">SWE 619 In Class Exercise Number 4A</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd821ee7">1. Instructions</a></li>
<li><a href="#org16a5b82">2. Links</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd821ee7" class="outline-2">
<h2 id="orgd821ee7"><span class="section-number-2">1</span> Instructions</h2>
<div class="outline-text-2" id="text-1">
<p>
Consider the Java <code>Iterator&lt;E&gt;</code> interface:
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #e45649;">public</span> <span style="color: #986801;">boolean</span> <span style="color: #a626a4;">hasNext</span>();
<span style="color: #e45649;">public</span> <span style="color: #986801;">E</span> <span style="color: #a626a4;">next</span>() <span style="color: #e45649;">throws</span> <span style="color: #986801;">NoSuchElementException</span>
<span style="color: #e45649;">public</span> <span style="color: #986801;">void</span> remove() <span style="color: #e45649;">throws</span> <span style="color: #986801;">IllegalStateException</span>
</pre>
</div>

<ol class="org-ol">
<li>What is the abstract state of an iterator without the <code>remove()</code> method?</li>
<li>Work through an example iterating over a list of strings: <code>["bat", "cat", "dog"]</code></li>
<li>What is the abstract state of an iterator with a <code>previous()</code> method?</li>
<li>What is the abstract state of an iterator with the <code>remove()</code> method?</li>
<li>Design an immutable version of the iterator.
<ol class="org-ol">
<li>How is <code>hasNext()</code> handled?</li>
<li>How is <code>next()</code> handled?</li>
<li>How is <code>remove()</code> handled?</li>
</ol></li>
<li>Exercise the immutable iterator with some sample client code.</li>
</ol>
</div>
</div>

<div id="outline-container-org16a5b82" class="outline-2">
<h2 id="org16a5b82"><span class="section-number-2">2</span> Links</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="./index.html">Syllabus</a></li>
<li><a href="./schedule.html">Schedule</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
